{
    "metadata": {
        "index": {
            "title": "Ignacio Wolf",
            "description": "Welcome to my web portfolio. I'm Ignacio Wolf, a passionate full stack web developer with experience in creating modern and scalable web applications. Take a look at my work and discover how I can help you take your project to the next level.",
            "keywords": "Full Stack Developer, Web Developer, Frontend, Backend, React.js, Angular, PHP, JavaScript, Node.js, Next.js, Web Development, Web Pages, Individuals, Companies, Web Maintenance, UI/UX Design, HTML5, CSS3, TypeScript, Git."
        },
        "archive": {
            "title": "Archive | Ignacio Wolf",
            "description": ""
        }
    },
    "header": {
        "role": "Fullstack Web Developer",
        "description": "I create modern digital solutions for businesses and individual clients, combining functional design and advanced technology.",
        "sections": {
            "about": "About",
            "experience": "Experience",
            "projects": "Projects"
        }
    },
    "about": {
        "p1": "I began my journey studying Information Systems Engineering at UTN, driven by the desire to solve real-world problems through software. In 2021 I had my first professional experience at Thalamus SA starting as a Jr Developer, working with high-traffic internal platforms and began automating processes with JavaScript and SQL on my own initiative. That technical curiosity led me to pursue training as a Full Stack Developer.",
        "p2": "I completed an intensive Full Stack program at Coderhouse and complemented it with advanced courses in React and Next.js. Since then, I've adopted a mindset of continuous improvement, dedicating daily time to studying, practicing, and building real-world projects. My role at Thalamus naturally evolved into Full Stack Developer, where I contributed to regional and international projects for clients such as British American Tobacco, using stacks like Angular, React, Node.js, Laravel, and MySQL.",
        "p3": "In 2024, I joined Phinxlab as a Full Stack Engineer to work on MiEscuela, the official educational platform of the Buenos Aires City Government, used by over 1,500 institutions and millions of users each month. There, I contribute to the development of critical features, refactoring legacy code, implementing automated testing, and designing scalable solutions.",
        "p4": "At the same time, I led the development of a web platform for Livosur, the volleyball league of southern Buenos Aires, completely digitizing their operations. I built a full stack solution with Next.js, Node.js, and PostgreSQL, currently used by more than 8,500 active players and 78 clubs.",
        "p5": "Today, I'm looking to continue growing as a Full Stack Developer in impactful projects, combining product vision, strong technical skills, and autonomy to build scalable, maintainable solutions aligned with business goals. I'm passionate about improving my skills, working in teams, and delivering real value with every line of code."
    },
    "experience": {
        "thalamusDev": {
            "date": "2023 - 2024",
            "role": "Full Stack Developer",
            "description": "I built full-stack solutions using React, Angular, Node.js, Laravel, and MySQL for both regional and international projects. In Conectados BAT, I developed a mobile-first PWA used by 15,000-20,000 monthly users across Argentina, Peru, and Paraguay. In MyGlo, I contributed to the development of an international e-commerce platform, implementing dynamic discounts and a referral program that increased user engagement. Finally, I led the end-to-end development of Red Point, achieving a pixel-perfect implementation based on Figma designs and delivering high client satisfaction."
        },
        "thalamusAA": {
            "date": "2021 - 2022",
            "role": "Junior Full Stack Developer",
            "description": "I automated key processes using JavaScript and SQL, reducing execution time from 4 hours to just 1. I managed 9 active platforms across 3 countries and handled over 10 Jira tickets per month. I created operational reports with SQL and Excel, performed functional testing, and provided support to corporate clients. Additionally, I contributed to the team achieving a 5/5 satisfaction score in the annual internal surveys."
        },
        "phinxlab": {
            "date": "2024 - Present",
            "role": "Full Stack Engineer",
            "description": "I developed and maintained a critical educational platform used by over 1,500 institutions, 600,000+ students, and more than 150,000 staff members across Argentina. I contributed to handling over 26 million monthly transactions, including attendance records, grades, assignments, and logins. I implemented end-to-end testing with Cypress and refactored legacy code to improve performance and maintainability. I designed and delivered the “Meal Attendance” module, introducing an optimized data model to ensure scalability. Within the team, I often took ownership of urgent or technically complex tasks, acting as a go-to developer."
        },
        "view": "View Full Résumé"
    },
    "projects": {
        "view1": "View Full Project ",
        "view2": "Archive ",
        "ownProject": "Own Project",
        "myglo": {
            "name": "My Glo - Bulgaria",
            "description": "The BAT Bulgaria e-commerce platform for the Glo electronic cigarette brand encompasses all the features that a modern e-commerce store should have. One of the most significant contributions to the project has been the implementation of the discount system, both automatic and manual. These discounts are applied intelligently, either when the user meets certain specific conditions or when they enter a discount code during the purchase process."
        },
        "vuse": {
            "name": "Vuse Go - Bulgaria"
        },
        "conectados": {
            "name": "Conectados BAT",
            "description": "The sales incentive program targets the retail staff, where monthly sales targets for each store are published, offering rewards upon achievement. My role in this project involves maintaining the application and implementing additional features as requested."
        },
        "portfoliov1": {
            "name": "Portfolio v1",
            "description": "My first portfolio developed in React."
        },
        "twitter": {
            "name": "Twitter Clone",
            "description": "Application that replicates the main functionalities of Twitter. It includes the entire authentication section, the ability to tweet, like, and retweet. It also features a personal profile where you can view your tweets, the ones you liked, and retweeted."
        },
        "financeapp": {
            "name": "Finance App"
        },
        "myrenault": {
            "name": "My Renault"
        },
        "turnorenault": {
            "name": "Mi Turno Renault",
            "description": "Renault's PWA streamlines the management of appointments for car services. The application enables users to easily and efficiently schedule maintenance and services appointments. With an intuitive interface and optimized features."
        },
        "redpoint": {
            "name": "Elegimos Red Point",
            "description": "This web project for the Redpoint brand by Tabsar includes a comprehensive authentication system and identity validation to ensure users are not minors during registration. The site is designed to be intuitive and secure, offering a reliable experience. It also features an image gallery to showcase products and services, and a contact section to facilitate communication with the company."
        },
        "miescuela": {
            "name": "Mi Escuela BA",
            "description": "I develop and fully manage the web system for Li.Vo.Sur, which includes a public section for viewing league information and a back-office for complete administration. The platform features modules for player transfers, payments, and registrations, streamlining the league’s organization and operations."
        },
        "livosur": {
            "name": "Li.Vo.Sur",
            "description": "I led the development of a web platform to manage 78 sports clubs and 8,500 active players, transforming a manual workflow into an efficient digital solution for a large regional community. I built a full-stack architecture using Next.js, Node.js, and PostgreSQL, and deployed it on a production VPS. I delivered real-time views of matches, results, and standings, along with a backoffice for managing tournaments, payments, and statistics. The platform reached over 3,000 unique monthly users (Google Analytics), and I received direct recognition from the league’s leadership for its usability and operational impact."
        }
    },
    "archive": {
        "allProjects": "All Projects",
        "tableHeaders": {
            "year": "Year",
            "project": "Project",
            "madeAt": "Made at",
            "technologies": "Technologies",
            "link": "Link"
        }
    }
}