{
    "Metadata": {
        "title":"Desarrollador Web"
    },
    "header":{
        "role":"Desarrollador Web Fullstack",
        "description":"Contruyo páginas web trabajando para Thalamus SA y también tomo pedidos particulares.",
        "sections":{
            "about":"Sobre mi",
            "experience":"Experiencia",
            "projects":"Proyectos"
        }
    },
    "about":{
        "p1":"Tras dedicar mi tiempo a mi formación desde 2019, he tenido la oportunidad de iniciar mi trayectoria profesional en Thalamus SA como Account Analyst desde el 2021. En este puesto, si bien no estaba directamente involucrado en la programación, obtuve experiencia al colaborar estrechamente con programadores, siendo responsable de realizar solicitudes y pruebas.",
        "p2":"En 2023, como reconocimiento a mi buen desempeño, se me ofreció la oportunidad de unirme al equipo de desarrollo como Desarrollador Web Fullstack Trainee. Durante este tiempo, amplié mis conocimientos al adentrarme en Angular y PHP, tecnologías que no había utilizado previamente.",
        "p3":"Mi objetivo primordial es avanzar en mi carrera en busca de oportunidades que me permitan crecer profesionalmente y contribuir al constante progreso de la organización. Estoy firmemente comprometido a desarrollar tanto mis habilidades en tecnología como en negocios, siempre buscando superar los límites y agregar valor donde sea posible."
    },
    "experience":{
        "thalamusDev": {
            "date": "2023 - Hoy",
            "role": "Desarrollador Web Fullstack",
            "description": "Responsable de desarrollar, actualizar y mantener Progressive Web Apps (PWAs), landing pages, e-commerce y diversos sitios web para proyectos de clientes importantes, tales como BAT, Renault, McCain, Tabsar, entre otros. Participación activa tanto en el desarrollo Frontend como del Backend, creando APIs específicas que se basan en la integración de la API de Thalamus."
        },
        "thalamusAA": {
            "date": "2021 - 2023",
            "role": "Analista de cuenta",
            "description": "Responsable de la gestión y análisis de cuentas corporativas, incluyendo seguimiento detallado y evaluación de rendimiento de las mismas. Así también, de la generación de informes para el equipo del cliente basados en análisis de datos. Todo esto manteniendo comunicación con el equipo interno y los clientes para juntos colaborar con el logro de los objetivos empresariales."
        },
        "view": "Ver resumen completo"
    },
    "projects":{
        "view1": "Ver todos los ",
        "view2": "proyectos",
        "myglo":{
            "name":"My Glo - Bulgaria",
            "description": "E-commerce de BAT Bulgaria para la marca de cigarrillos electrónicos Glo, que ofrece toda característica que un comercio electrónico moderno debería tener. Una de las contribuciones más significativas al proyecto ha sido la implementación del sistema de descuentos, tanto automáticos como manuales. Estos descuentos se aplican de manera inteligente, ya sea cuando el usuario cumple ciertas condiciones específicas o cuando ingresa un código de descuento durante el proceso de compra."
        },
        "conectados":{
            "name":"Conectados BAT",
            "description": "Programa de incentivo de ventas para el staff de tiendas con venta al público. En ella se publican objetivos de ventas mensuales a cumplir por el local, lo que permite acceder a premios en caso de cumplirlos. Mi rol en este proyecto es dar mantenimiento a la aplicacion e implementar pequeñas características adicionales que se solicitan agregar."
        }
    }
}