{
    "Metadata": {
        "title":"Desarrollador Web"
    },
    "header":{
        "role":"Desarrollador Web Fullstack",
        "description":"Contruyo páginas web trabajando para Thalamus SA y también tomo pedidos particulares.",
        "sections":{
            "about":"Sobre mi",
            "experience":"Experiencia",
            "projects":"Proyectos"
        }
    },
    "about":{
        "p1":"Desde 2021, he iniciado mi trayectoria profesional en Thalamus SA como Account Analyst.",
        "p2":"En 2023, decidí dar un paso adelante al unirme al equipo de desarrollo, lo que ha significado una oportunidad invaluable para expandir mis habilidades técnicas y capacitarme para enfrentar una variedad de desafíos.",
        "p3":"Mi objetivo primordial es avanzar en mi carrera buscando oportunidades que me permitan crecer profesionalmente y contribuir al éxito continuo de la organización. Estoy firmemente comprometido a desarrollar tanto mis habilidades en tecnología como en negocios, buscando siempre superar los límites y agregar valor donde sea posible."
    },
    "experience":{
        "thalamusDev": {
            "date": "2023 - Hoy",
            "role": "Desarrollador Web Fullstack",
            "description": "Construir, actualizar y dar mantenimiento a PWAs, landing pages, e-commerce y otros tipo de sitios web, para proyectos de clientes importantes como los son BAT, Renault, McCain, Tabsar, entre otras. Participando tanto en el desarrollo Frontend, asi como en el Backend al construir APIs específicas de los proyectos que utilizan como integración la API de Thalamus."
        },
        "thalamusAA": {
            "date": "2021 - 2023",
            "role": "Analista de cuenta",
            "description": "Responsable de la gestión y análisis de cuentas corporativas, incluyendo seguimiento detallado y evaluación de rendimiento de las mismas. Así también, de la generación de informes para el equipo del cliente basados en análisis de datos. Todo esto manteniendo comunicación con el equipo interno y los clientes para juntos colaborar con el logro de los objetivos empresariales."
        },
        "view": "Ver resumen completo"
    }
}